<template>
  <div>
    <h1>Данное приложение было разработано с целью изучения Vue.js</h1>
    <h3>Было изучено и использовано:</h3>
    <ul class="list">
      <li> Компонент App </li>
      <li> Интерполяция </li>
      <li> Methods. V-ON. Слушатели событий </li>
      <li> Vue devtools. Инструменты разработчика </li>
      <li> Cтили </li>
      <li> Отрисовка в цикле. Директива V-FOR </li>
      <li> Создание нового поста </li>
      <li> Двустороннее связывание </li>
      <li> Модификаторы stop, prevent </li>
      <li> Декомпозиция. Переиспользуемые компоненты </li>
      <li> Props. Передача данные в компонент </li>
      <li> $emit. Обмен данными между дочерним и родительским компонентом </li>
      <li> Библиотека UI компонентов </li>
      <li> Глобальная регистрация компонента </li>
      <li> Подробно о V-MODEL </li>
      <li> Удаление поста. Ключи KEY в цикле </li>
      <li> Отрисовка по условию </li>
      <li> Модальное окно </li>
      <li> Модификаторы V-MODEL </li>
      <li> Работа с сервером. Axios </li>
      <li> Жизненный цикл компонента </li>
      <li> Индикатор загрузки данных </li>
      <li> Выпадающий список. Сортировка постов </li>
      <li> Наблюдаемые WATCH и вычисляемые COMPUTED свойства </li>
      <li> Анимации transition group </li>
      <li> Поиск постов. Фильтрация </li>
      <li> Пагинация. Постраничный вывод </li>
      <li> Динамический биндинг классов и стилей </li>
      <li> Динамическая пагинация. Бесконечная лента. Intersection API </li>
      <li> Refs. Доступ к DOM элементу </li>
      <li> VUE-ROUTER. Постраничная навигация </li>
      <li> Динамическая навигация </li>
      <li> Создаение собственных директив V-INTERSACTION и V-FOCUS </li>
      <li> Mixins. Примеси </li>
      <li> Vuex. Глобальное состояние приложения </li>
      <li> Composition API</li>
    </ul>
  </div>
</template>

<script>
export default {

};
</script>

<style scoped>
  .list {
    margin-left: 20px;
  }
  h3 {
    margin: 10px 0;
  }
</style>